#include <iostream>
#include <cstring> 
#include <fstream>
#include <conio.h>
#include <windows.h>
#include <ctime>
#include <algorithm>
#include <vector>
using namespace std;

HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE); //Для  коректної работи з консолю.

// //задаємо константи, що визначають довжину символьних полів
const int f_name=15, f_datebirth=8, f_country=15, f_club=15, f_yearinclub=23, f_price=15;
const int tablePage=10; // оголошуємо константу, що регламентує кількість
	



//створюємо основну структуру.
struct footballer
{
	char name[f_name]; // ПІБ гравця
	char country[f_country]; // країна народження
	char club[f_club]; // клуб гравця	
	int birth; // дата народження 	
	int year; // рік початку гри за клуб
	int price; // ціна гравця

};

//глобальні змінні
fstream f; // для створення файлів
char filename[100]; // змінна імені файла 


// ** Процедура для відкриття/закриття файла с комп'ютера.**
void open()
{
	
	system("cls");
    cout << "Напишіть повне ім'я файла (наприклад: \"D:\\kyrsova\\footballer.dat\"): ";
    gets(filename);
    opf: 
	f.open(filename, ios::in | ios::out | ios::binary); // відкриваємо файл для зчитування в бінарному режимі.
	if(!f.is_open()) //якщо файл не відкрився.
	{
	printf("\n\n Помилка при створенні файла, спроба створити його.\a \n\n");
	ofstream ofs(filename); //створили файл - його можна буде зчитати.
	ofs.close(); // закриваємо потік створеного файла.
	printf("Файл створений. Спробуйте знову! \n\n ");
	goto opf;
	} 
	else {printf(" Файл відкритий. \n\n ");}
	system("pause");
}
 


// ** ПРОЦЕДУРА ДОДАВАННЯ ЗАПИСУ **
	
void create()
{ 
	
	system("cls");
	int i; // для номера нових записів 
	int pp; // для коректної работи getch, pp - press please))
	int j; // для збереження довжини змінних char 
	int t; // для работи з символьними рядками, t - text
	footballer pz; // змінна для роботи з кожним записом.
	
	f.clear(); // очищуємо прапорці помилок.	
	f.seekg(0,ios::end); // переводимо вказівник на кінець файлу
	i=f.tellp()/sizeof(struct footballer); //визначаємо кількість записів у
	s11: 
	i++; //Номер нового запису.
 	
 	
	// обнулюяємо поля запису
	strcpy(pz.name,""); 
	strcpy(pz.country,"");
	strcpy(pz.club,"");
	
	pz.birth = 0;
	pz.year = 0;
	pz.price = 0;
	pp=0; 
	
	
	//далі заповнюємо поля нового запису. 
	cout<< "Гравець № " << i<< ": \n";
	
	//ПІБ
	cout<< " ПІБ гравця (Наприклад: Гребенко І.В.): ";
	do
	{
	gets(pz.name); // зчитуємо значення у символьне поле
	t=strlen(pz.name); //визначаємо довжину символьного поля 
	}
	while (t==0); 
	for (j = t; j < f_name-1; j++) 
	strcat(pz.name," ");
	
	//Країна
	cout<< "Країна народження: ";
	do
	{
		gets(pz.country); 
		t=strlen(pz.country); 
	}
	while (t==0); 
	for (j = t; j < f_country-1; j++) 
	strcat(pz.country," ");
	
	//Клуб
	cout<< "Клуб: ";
	do
	{
		gets(pz.club); 
		t=strlen(pz.club); 
	}
	while (t==0);
		for (j = t; j < f_club-1; j++) 
		strcat(pz.club," ");
				
	//Рік народження
	cout<< "Рік народження гравця: ";
	cin >> pz.birth; 
	  
	//Рік вступу в клуб
	cout<< "Рік вступу в клуб: ";
	cin >> pz.year; 
	  
	//Ціна
	cout<< "Вартість гравця (мілн. євро): ";
	cin >> pz.price;
	
	f.write((char *)&pz, sizeof(struct footballer)); // Записуємо у файл сформований масив.
	s12:
	cout<< "Для введення ще одного запису натисніть -> Enter, для закінчення -> Esc \n";
	if ((pp=getch())!=27)// - Esc
	if (pp==13) // - Enter
		goto s11;
	else
		goto s12;
}
	
	
// ** Процедура виведення усіх записів **
	
void print()
{
	
	footballer zap; // змінна для роботи із записом
	int space=0; // змінна для кількості записів
	int position=0; // кількість записів на сторінці
	int im=0; // змінна для збереження коду натиснутої клавіші
	
	f.clear(); // // очищуємо прапорці помилок	 
	f.seekp(0,ios::end); // переміщуємо вказівник на кінець файлу
	int size=f.tellp()/sizeof(struct footballer); // визначаємо кількість записів у файлі
	if (size<1)
	{ // якщо записів немає, то дати повідомлення на екран
		cout<< "Файл порожній \a";
		system("pause");
		goto ex; // // перехід на закінчення виконання процедури
	}
start:
	f.clear(); // очищуємо прапорці помилок	 
	f.seekp(position*tablePage*sizeof(struct footballer),ios::beg); // переміщуємо вказівник на потрібний запис, що вираховується за наступною формулою position*tablePage*sizeof(struct footballer);
	system("cls");	 
	printf("| Загальна кількість записів у файлі: %5d                                                        Сторінка %2d  |\n",size, position+1);
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	cout<<"|    |       ПІБ       | Рік народження  |      Країна    |      Клуб      |Рік початку гри за клуб|   Ціна    |\n";
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	
	space=0; //обнуляємо значення лічильника кількості записів на екрані
	
	while ((!f.eof()) && (space<tablePage)) //умова виконання циклу: поки не досягли кінця файлу або кількість виведених записів на екран менше tablePage
	{ 
	f.read((char *)&zap, sizeof(struct footballer)); //зчитування запису з файлу у змінну zap
	if (f.eof()) break; // якщо досягнуто кінець файлу, то вийти з циклу// виводимо поля зчитаного запису на екран
	
	printf("| %2d | %15s | %15d | %5s | %10s | %21d | %9d |\n",((1+space)+((position)*tablePage)), zap.name, zap.birth, zap.country, zap.club, zap.year, zap.price);
	space++; //збільшуємо лічильник кількості записів на екрані на 1
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	}

	cout<<"|____|_________________|_________________|________________|________________|_______________________|___________|\n";
	cout<<"| <-- Попередня сторінка (1)                                                         Наступна сторінка (2) --> |\n";
	cout<<"|==============================================================================================================|\nEsc - Головне меню\n";
	 
click: // якщо не та кнопка
	
	im = getch(); // зчитали нажату клавішу
	switch(im)
	{ 
	case 50: // якщо натиснута клавіша "стрілка вниз" - Down
	{  
		if (position < (size-1) / tablePage)
			++position; //збільшуємо значення якщо
		goto start; //повернення до мітки star.
	}
	 
	case 49: // якщо натиснута клавіша "стрілка вгору " - UP
	{ 
		if(position>=1)
			--position;
		goto start; //перехід до мітки star:
	}
	case 27: // якщо натиснута клавіша "стрілка назад " - ESC
		goto ex;

	goto click;
	}
ex:;
}
	

// **Процедура для редагування записів про гравців **	
	
void redaction()
{ 	
	
	int t, i, j;
	int im; // змінна для збереження коду натиснутої клавіші
	footballer zap; // оголошуємо змінну для роботи із записом.
	 
	start:  
	system("cls"); 
	int nom=0;  //номер запису.
	cout<<"Введіть номер запису для редагування: ";
	cin >> nom;
	f.clear(); // очищуємо прапорці помилок 	 
	f.seekp((nom-1)*sizeof(struct footballer),ios::beg); // переміщуємо вказівник на кінець файлу
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	cout<<"|    |       ПІБ       |  Рік народження |      Країна    |      Клуб      |Рік початку гри за клуб|   Ціна    |\n";
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	
	
	f.read((char *)&zap, sizeof(struct footballer));
	printf("|    | %15s | %15d | %5s | %10s | %21d | %9d |\n", zap.name, zap.birth, zap.country, zap.club, zap.year, zap.price);
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	cout<<"|____|_________________|_________________|________________|________________|_______________________|___________|\n";
	cout<<"| <-- Попередня сторінка                                                                  Наступна сторінка--> |\n";
	cout<<"|==============================================================================================================|\nEsc - Головне меню \n";
	 
	 
	again:	
	im=getch(); // зчитуємо код натиснутої клавіші
	if (im == 13) //  не натиснута - ENTER
	{
	footballer pz; //змінна для редагування.
	
	strcpy(pz.name,""); 
	strcpy(pz.country,"");
	strcpy(pz.club,"");
	
	pz.birth = 0;
	pz.year = 0;
	pz.price = 0;
	
	cout<<"Редагування гравця #" << nom << ": \n"; 
	cout<< "Гравець № " << i<< ": \n";

	//ПІБ
	cout<< "ПІБ гравця (Наприклад: Гребенко І.В.): ";
	do
	{
		gets(pz.name); 
		t=strlen(pz.name); 
	}
	while (t==0); 
	for (j = t; j < f_name-1; j++) 
	strcat(pz.name," ");
	
	//Країна
	cout<< "Країна народження: ";
	do
	{
		gets(pz.country); 
		t=strlen(pz.country); 
	}
	while (t==0); 
	for (j = t; j < f_country-1; j++) 
	strcat(pz.country," ");
	
	//Клуб гравця
	cout<< "Клуб гравця: ";
	do
	{
		gets(pz.club); 
		t=strlen(pz.club); 
	}
	while (t==0);
	for (j = t; j < f_club-1; j++) 
	strcat(pz.club," "); 			
	
	//Рік народження
	cout<< "Рік народження:";
	cin >> pz.birth; 
	  
	//Рік вступу в клув
	cout<< "Рік вступу в клуб: ";
	cin >> pz.year; 
	  
	//Ціна
	cout<< "Вартість гравця (мілн. євро): ";
	cin >> pz.price; 

	 
	printf("Для підтвердження і виходу - Esp. Для повернення Enter \n");
	 
error:
	
	im=getch(); // зчитуємо нажату клавішу 
	if (im == 13) // натиснута - ENTER
	{
	f.seekp((nom-1)*sizeof(struct footballer),ios::beg); // вказівник на місце запису
	f.write((char *)&pz, sizeof(struct footballer)); // новий запис
	goto start;
	}
	else
	if (im == 27) // натиснута - ESC
		f.seekp((nom-1)*sizeof(struct footballer),ios::beg); 
		f.write((char *)&pz, sizeof(struct footballer)); 
		goto theend;
	}
	else
	if (im != 27) // НЕ натиснута - ESC
	goto error;
	system("pause");
	theend:;
	}	


void destroy()
{
	system("cls"); 
	footballer zap; // змінна для роботи з записом.
	int im=0; 
	int nom=0; // номер запису
	
	cout<<"Введіть номер запису, який хочете видалити: "; 
	cin >> nom; 
	f.clear(); // очищеємо прапорець помилок	 
	f.seekp((nom-1)*sizeof(struct footballer),ios::beg); //Переміщуємо вказівник на потрібний запис
	printf("\n|   Цей запис буде видалено (назавжди)!                                                                             |\n");
	
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	cout<<"|    |       ПІБ       |  Рік народження |      Країна    |      Клуб      |Рік початку гри за клуб|   Ціна    |\n";
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	f.read((char *)&zap, sizeof(struct footballer));
	printf("|    | %15s | %15d | %5s | %10s | %21d | %9d |\n", zap.name, zap.birth, zap.country, zap.club, zap.year, zap.price);
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	cout<<"|____|_________________|_________________|________________|________________|_______________________|___________|\n";
	cout<<"| <-- Попередня сторінка                                                                 Наступна сторінка --> |\n";
	cout<<"|==============================================================================================================|\nEnter - Головне меню\n";
	
	again2:
	 	
	im=getch(); // зчитуємо код натиснутої клавіші
	if (im == 13) // якщо натиснута клавіша - Enter
	{ 
	f.clear(); // очистили прапорці помилок
	f.seekp(0,ios::end); //Переміщуємо вказівник на кінець записів
	
	int size=f.tellp()/sizeof(struct footballer); //визначаємо кількість записів уфайлі
	footballer *mas; 
	mas = new footballer[size+1]; // виділяємо динамічну пам’ять під масив на кількість записів у файлі
	f.clear(); // очистили прапорці помилок
	f.seekp(0,ios::beg); // переміщуємо вказівник на початок у файлі
	
	int i=0;
	
	while (!f.eof()) // зчитуємо у динамічний масив записи з файлу
	{ 
	f.read((char *)&mas[i], sizeof(struct footballer));
	i++;
	}
	f.close(); // закриваємо файл
	f.clear(); // очистили прапорці помилок
	f.open(filename,ios::in | ios::out | ios::trunc); // відкриваємо файл та очищуємо його - знищуємо усі записи у файлі
	f.seekp(0,ios::beg); // переміщуємо вказівник на початок у файлі

	for (i=0;i<size;i++) //цикл забезпечує запис усіх елементів масиву у файл
	{
		if (i!=(nom-1)) // якщо поточний елемент не дорівнює заданому
			f.write((char *)&mas[i], sizeof(struct footballer)); //запис поточного елементу у файл.
	}		
	delete []mas; // очищуємо виділену динамічну пам’ять під масив записів
	
	cout<<"Запис видалено!\n";
	system("pause");
	} 
	else
	if (im != 27) //якщо натиснута клавіша не є Esc
	goto again2;
	}


void exit() 
{
	system("cls");
	cout<<"\n Натисніть: \n\n Enter для того, щоб вийти. \n\n Esc для того, щоб повернутися в головне меню. \n\n\n";
	start:
	int go=getch(); ///зчитуємо натиснуту клавішу

	if (go!=13) // перевірка чи не натиснута клавіша - Enter
	if (go==27) // перевірка чи натиснута клавіша - Esc
	goto exit;
	else
	goto start;
	if(f.is_open())
	f.close(); // закриваємо файл, якщо він був відкритий
	exit(0); // закриваємо програму / виходимо з неї
	exit:;
	}



	

//  ** Процедура для довідки **
void info() 
{
		
	int im;	
	start:
	system("cls");
		
	cout<<" |=========================================================================|\n";
    cout<<" |                              * Довідка *                                |\n";
	cout<<" |=========================================================================|\n";
	cout<<" |                           * Головне меню  *                             |\n";
	cout<<" |-------------------------------------------------------------------------|\n";
	cout<<" | 1. Відкрити/створити файл.                                              |\n";      
	cout<<" | Потрібно відкрити вже створений файл.                                   |\n"; 
	cout<<" | Потрібно створити новий файл.                                           |\n";
	cout<<" | Якщо ввести назву мого файлу, то ви почнете роботу з готовим файлом.    |\n";
    cout<<" |-------------------------------------------------------------------------|\n";
	cout<<" | 2. Додати дані про гравців                                              |\n";
	cout<<" | При створені файлу, він буде пустим.                                    |\n";
	cout<<" | Користувач має наповнити його, інформацією про гравців.                 |\n";
	cout<<" |-------------------------------------------------------------------------|\n";
	cout<<" | 3. Редагувати дані про гравця                                           |\n";
	cout<<" | Можна відредагувати дані про наявних гравців.                           |\n";
	cout<<" |-------------------------------------------------------------------------|\n";
	cout<<" | 4. Видалити дані про гравця з файлу                                     |\n";
	cout<<" | Якщо якась одна з записів вам стала непотрібною, ви можете її видалити. |\n";
	cout<<" | Видалити назавжди.                                                      |\n";
	cout<<" |-------------------------------------------------------------------------|\n";
	cout<<" | 5. Вивести всю інформацію про гравців                                   |\n";
	cout<<" | Виведеться вся інформація про наявних гравців у вашому списку.          |\n";
	cout<<" |-------------------------------------------------------------------------|\n";
	cout<<" | 6. Пошук гравців за мітками                                             |\n";
	cout<<" | Дає змогу відсортувати гравців за критеріями:                           |\n";
	cout<<" |  * Футболісти вказаного клубу.                                          |\n";
	cout<<" |  * Футболісти народжені у вказаній країні.                              |\n";
	cout<<" |  * Гравці народжені у вказаний рік.                                     |\n";
	cout<<" |  * Футболісти, що молодші 30.                                           |\n";
	cout<<" |-------------------------------------------------------------------------|\n";
	cout<<" | 7. Довідка                                                              |\n";
	cout<<" | Повна інформація, що включає в себе головне меню.                       |\n";
	cout<<" | Яку функцію виконує та чи їнша клавіша.                                 |\n";
	cout<<" |-------------------------------------------------------------------------|\n";
	cout<<" | 8. Розробник                                                            |\n";
	cout<<" | Містить інформацію про розробника.                                      |\n";
	cout<<" |-------------------------------------------------------------------------|\n";	
	cout<<" | 9. Вихід                                                                |\n";
	cout<<" | Закривається програма.                                                  |\n";
	cout<<" |=========================================================================|\n";	
	
	cout<< "\n   Esc --> Головне меню.\n\n   ";
	again:
	im=getch(); // зчитуємо нажату клавішу. 
	if (im == 27)
	{   // якщо - ESC
	goto leave;
	}
	else{
	goto again;
	}

	leave:;
}
	
	
	
// ** Процедура про розробника **

void god() 
{

	int im;	
	start:
	system("cls");	
	cout<<" |=======================================================================|\n";
    cout<<" |                      * Інформація про розробника *                    |\n";
	cout<<" |-----------------------------------------------------------------------|\n";
	cout<<" | ПІБ: Баляс Дарина Вікторівнра.                                        |\n";
	cout<<" | Вік: 17 років.                                                        |\n";
	cout<<" |                                                                       |\n";
	cout<<" | Місце навчання: Національний університет харчових технологій (НУХТ)   |\n";
	cout<<" | Курс: 1.                                                              |\n";
	cout<<" | Група: КН-1-2.                                                        |\n";
	cout<<" |=======================================================================|\n";
		
	cout<< "\n   Esc --> Головне меню.\n\n   ";
	again:
	im=getch(); // зчитуємо нажату клавішу.
	if (im == 27){ // якщо це - ESC
	goto leave;
	}
	else{//якщо це не - ESC
	goto again;
	}	
	leave:;		
}

int poshuk(char *a, char *b) // порівняння двох рядків
{
	int i=0, j=strlen(a);
	while(j>i){
		if(a[i]!=b[i])
			return 0;
		i++;
	}
	return 1;
}



// ** Процедура пошуку за крубом **

void clubfound()  
{
	system("cls");
	l1:
	footballer zap; // змінна для роботи з записом 
	int space; // кількість записів виведених на екран
	int position=0; // кількість виведених записів

	f.clear(); 
	f.seekp(position*tablePage*sizeof(struct footballer),ios::beg); // position*tablePage*sizeof(struct footballer) - формула
	system("cls");
	char one[15]; 
	cout<<"Введіть назву клубу:  ";
	cin>>one;
	cout<<"|==============================================================================================================|\n";
	cout<<"|    |       ПІБ       |  Рік народження |      Країна    |      Клуб      |Рік початку гри за клуб|   Ціна    |\n"; 
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	space=0; 
	while (!f.eof()) //умова виконання циклу: поки не досягли кінця файлу 
	{
	f.read((char *)&zap, sizeof(struct footballer)); // зчитування в zap
	if(poshuk(one,zap.club)==1)  //порівнюємо нашу змінну з записом у файлі.
	printf("| %2d | %15s | %15d | %5s | %10s | %21d | %9d |\n",((1+space)+((position)*tablePage)), zap.name, zap.birth, zap.country, zap.club, zap.year, zap.price);
	space++; 
	}
	cout<<"|____|_________________|_________________|________________|________________|_______________________|___________|\n";
	cout<<"|   Enter <-- Повторити                	                                                 Головне меню --> Esc |\n"; 
	cout<<"|==============================================================================================================|\n";
	l2:
	int go=getch(); // зчитуємо нажаиу клавішу.
	if (go==13) // якщо - ENTER
	{
	goto l1;
	}
	if (go==27) // якщо - Esc
	{
	goto exit1;
	}
	else
	{
	goto l2;
	}
	exit1:;
} 

// ** Пошук за країною **

void countryfound()
{ 
	system("cls");
	l1:
	footballer zap; 
	int space; 
	int position=0;	 
	f.clear(); 
	f.seekp(position*tablePage*sizeof(struct footballer),ios::beg);
	system("cls");
	char one[15];
	cout<<"Введіть країну, для пошуку гравця:  ";
	cin>>one;
	cout<<"|==============================================================================================================|\n";
	cout<<"|    |       ПІБ       |  Рік народження |      Країна    |      Клуб      |Рік початку гри за клуб|   Ціна    |\n";
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	space=0; 
	while (!f.eof()) 
	{
	f.read((char *)&zap, sizeof(struct footballer)); 
	if(poshuk(one,zap.country)==1) // знову порівнюємо
	printf("| %2d | %15s | %15d | %5s | %10s | %21d | %9d |\n",((1+space)+((position)*tablePage)), zap.name, zap.birth, zap.country, zap.club, zap.year, zap.price);
	space++; 
	}
	cout<<"|____|_________________|_________________|________________|________________|_______________________|___________|\n";
	cout<<"|   Enter <-- Повторити                	                                                 Головне меню --> Esc |\n";
	cout<<"|==============================================================================================================|\n";
	l2:
	int go=getch(); 
	if (go==13) 
	{
	goto l1;
	}
	if (go==27) 
	{
	goto exit2;
	}
	else
	{
	goto l2;
	}
	exit2:;
} 

// **  Пошук за роком народження **

void birthfound() 
{
	system("cls");
	l1:
	footballer zap; 
	int space; 
	int position=0; 
	f.clear(); 
	f.seekp(position*tablePage*sizeof(struct footballer),ios::beg);
	system("cls");
	int one = 0;
	cout<<"Введіть рік народження:  ";
	cin>>one;
	cout<<"|==============================================================================================================|\n";
	cout<<"|    |       ПІБ       |  Рік народження |      Країна    |      Клуб      |Рік початку гри за клуб|   Ціна    |\n";
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	space=0;
	while (!f.eof()) 
	{
	f.read((char *)&zap, sizeof(struct footballer));
	if(one == zap.birth)
	printf("| %2d | %15s | %15d | %5s | %10s | %21d | %9d |\n",((1+space)+((position)*tablePage)), zap.name, zap.birth, zap.country, zap.club, zap.year, zap.price);
	space++; 
	}
	cout<<"|____|_________________|_________________|________________|________________|_______________________|___________|\n";
	cout<<"|   Enter <-- Повторити                	                                                 Головне меню --> Esc |\n";
	cout<<"|==============================================================================================================|\n";
	l2:
	int go=getch(); //зчитуємо натиснуту клавішу
	if (go==13) 
	{
	goto l1;
	}
	if (go==27) // перевірка чи натиснута клавіша - Esc
	{
	goto exit3;
	}
	else
	{
	goto l2;
	}
	exit3:;
} 


// ** Пошук молодших 30 років **

void under30clubfound() 
{
	time_t now = time(0);
    tm *ltm = localtime(&now);
	int nowyear = 1900 + ltm->tm_year; 	
	system("cls");
	l1:
	footballer zap;
	int space; 
	int position=0;
	f.clear(); 
	f.seekp(position*tablePage*sizeof(struct footballer),ios::beg); 
	system("cls");
	char one[15];
	cout<<"Введіть назву клубу:  ";
	cin>>one;
	cout<<"|==============================================================================================================|\n";
	cout<<"|    |       ПІБ       |  Рік народження |      Країна    |      Клуб      |Рік початку гри за клуб|   Ціна    |\n";
	cout<<"|====|=================|=================|================|================|=======================|===========|\n";
	space=0; 
	while (!f.eof()) 
	{
	f.read((char *)&zap, sizeof(struct footballer));
	if((poshuk(one,zap.club)==1)&&((nowyear-zap.birth)<30)) // порівнюємо і шукаємо
	printf("| %2d | %15s | %15d | %5s | %10s | %21d | %9d |\n",((1+space)+((position)*tablePage)), zap.name, zap.birth, zap.country, zap.club, zap.year, zap.price);
	space++; 
	}
	cout<<"|____|_________________|_________________|________________|________________|_______________________|___________|\n";
	cout<<"|   Enter <-- Повторити                	                                                 Головне меню --> Esc |\n";
	cout<<"|==============================================================================================================|\n";
	l2:
	int go=getch(); 
	if (go==13) 
	{
	goto l1;
	}
	if (go==27) 
	{
	goto exit5;
	}
	else
	{
	goto l2;
	}
	exit5:;
	} 
 
// ** Процедура пошуку за мітками **

void found() 
{
	int ch = 0;
	f.clear(); // очищуємо прапорці помилок.	 
	cout << " Список:\n";
	cout << "	1. Список футболістів вказаного клубу.\n";
	cout << "	2. Футболісти народжені у вказаній країні.\n";
	cout << "	3. Гравці вказаного року народження. \n";
	cout << "	4. Футболісти, що молодші. 30\n";	 
	cin >> ch;
	
switch(ch) 
{
	case 1: //клуб
	{       	
		clubfound();
		goto kk1;
	}
	
	case 2: //країна
	{       
	
		countryfound();
		goto kk1;
	}
	
	case 3: // рік народж.
	{       	 
		birthfound();
		goto kk1;
	}
	
	case 4: // молодші 30
	{ 	
		under30clubfound();
		goto kk1;
	}	
	
	}
	kk1:;	
}
	

// ** Мейн в процедурі	**
	
void menu()
{	
	int im=0, p=0; 

	COORD crd, end; //змінні для координат
	crd.X=3; 
	crd.Y=10; 
	end.X=5; 
	end.Y=18; 
	start:
	system("cls");
	 
	cout<<" |===========================================================================|\n";
    cout<<" |                  * Довідник українських футболістів *                     |\n";
	cout<<" |---------------------------------------------------------------------------|\n";
	cout<<" |                           * Головне меню *                                |\n";
	cout<<" |---------------------------------------------------------------------------|\n";
	cout<<" | [~] | 1. Відкрити/створити файл                                           |\n";
	cout<<" | [~] | 2. Додати дані про гравця                                           |\n";
	cout<<" | [~] | 3. Редагувати дані про гравця                                       |\n";
	cout<<" | [~] | 4. Видалити дані про гравця                                         |\n";
	cout<<" | [~] | 5. Вивести всю інформацію про гравців                               |\n";
	cout<<" | [~] | 6. Пошук гравців за мітками                                         |\n";
	cout<<" | [~] | 7. Довідка                                                          |\n";
	cout<<" | [~] | 8. Розробник                                                        |\n";
	cout<<" | [~] | 9. Вихід                                                            |\n";
	cout<<" |===========================================================================|\n";
	if(!f.is_open()) // перевіряє чи відкритий файл.
	cout<<"\n Файл відсутній, вкажіть чи створіть його.\n";
	else
	cout<<"\n Файл відкритий: \""<< filename <<"\"\n"; 
	SetConsoleCursorPosition(hConsole, crd); // перевели вказівник на x-y координати, що вказали вище
	SetConsoleTextAttribute(hConsole, (WORD) ((1 << 0) | 5)); //вказали колір для шрифту + фона
	cout<<"[~]";
	SetConsoleTextAttribute(hConsole, (WORD) ((9 << 0) | 0)); //вказали колір для шрифту + фона
	SetConsoleCursorPosition(hConsole, end); //перевели вказівник на x-y координати, що вказали вище
	im=getch(); //отримуємо код натиснутої клавіші
	switch(im)
	{
	case 72: // стрілка вгору
	{ 
	if(crd.Y>5) crd.Y--; // якщо виходим за межі - зменшуємо на 1
	goto start; // повертаємось назад
	}
	case 80: // стрілка вниз
	{  
	if(crd.Y<13) crd.Y++; // якщо ми не вкінці - координаты зміняться
	goto start; // повертаємося назад
	} 
	
	case 13:
	{
	p=crd.Y+45; // номер пункта меню, что будет в области движения символа
	if((!f.is_open())&&(p!=56)) 
	{
	if((!f.is_open())&&(p!=57)) 
	{
	if((!f.is_open())&&(p!=58)) p=50; // Если файл не открыт, то пользователь сможет выбрать только 1-ый вариант. Ну и выход
	}
	}

// ** Проходимся по процедурам **

	switch(p)
	{
	case (50): 
	{      				
		open(); // відкрити файл
	goto start; 
	}
	
	case 51:
	{
		create(); //створити запис      
	goto start;
	}
	
	case 52:
	{
	redaction(); //редагувати запис      
	goto start;
	}
	
	case 53:
	{
		destroy(); //видалити запис    
	goto start;
	}
		
	case 54:
	{          
		print(); //вивести всі записи
	goto start;} 
	
	case 55:
	{      
		found(); //знайти по мітка 
	goto start;
	} 
		
	case 56:
	{          
	info();     
	goto start; //довідка
	} 
		
		case 57:{      
		god();     
		goto start; //розробник
		} 
	
	case 58:
	{           
	exit(); //вихід
	}
	goto start; 
	}
	
	default: goto start; // якщо не та клавіша.
	}
	}
}	 
	 
int main(){
	system("cls");		
	SetConsoleCP(1251); 
	SetConsoleOutputCP(1251);
	system("color 9"); 
		menu(); // процедура мейна.
	system("pause");
	return 0;
} 
